Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/Acquaintance .tmx
Source language: en
Languages: es_419

source: Oh, It's nothing, really!!
es_419: No es nada importante. ¡¡De verdad!!

source: Yes, let's.
es_419: Sí, vamos.

source: I really enjoyed it.
es_419: Lo disfruté mucho.

source: Stride
es_419: Tac

source: Clack
es_419: Clac

source: Who are you talking about?
es_419: ¿De quién hablas?

source: Did they run into a problem?
es_419: ¿Tuvieron algún problema?

source: Argue
es_419: Discuten

source: Here's your order.
es_419: Aquí tienen su pedido.

source: Besides, you didn't look well after the stomachache…
es_419: Además, no te veías bien después del dolor de estómago…

source: She's allergic to metal.
es_419: pero ella es alérgica al metal.

source: Then, let's eat dinner first.
es_419: Mejor cenemos primero.

source: Okay, I think that's enough for today…
es_419: Bueno, creo que por hoy ya está bien.

source: Yeah, hello?
es_419: Hola, ¿sí?

source: Shall we continue?
es_419: ¿Seguimos?

source: Tattered…
es_419: Dañado

source: It's been a while.
es_419: Tanto tiempo.

source: Hey, I'm all done for today.
es_419: Bueno, terminé por hoy.

source: Mumble
es_419: Balbucea

source: Haha, can we make this quick?
es_419: Jaja, ¿podríamos apurarnos?

source: Mr. Kim.
es_419: Señor Kim.

source: Quiet…
es_419: Silencio…

source: Did you really take Mr. Jung there with you?
es_419: ¿En serio llevaste al señor Jung allí?

source: He never asked questions like this before.
es_419: Nunca me hace este tipo de preguntas.

source: Blush
es_419: Se sonroja

source: What?!
es_419: ¡¡¡¿Qué?!!!

source: I've never walked the aisles myself to handpick gifts before.
es_419: Nunca antes había elegido yo mismo un regalo.

source: It's nothing too serious… they just need us to check something on the blueprints.
es_419: Nada serio. Quieren que verifiquemos algo de los planos.

source: Oh, that won't be--
es_419: Ah, no es nece…

source: Really?
es_419: ¿En serio?

source: I'll be right back.
es_419: Ya vuelvo.

source: Sorry about that.
es_419: Perdón por eso.

source: Maybe I should've gone for that…
es_419: Quizá debería haber pedido eso…

source: "Laundry complete"?
es_419: ¿"Lavado completo"?

source: Oh, my heel fell off…
es_419: Se me rompió el taco…

source: Sorry to text you so abruptly.
es_419: Perdón por el mensaje tan brusco.

source: Maybe it's because I was with Wooseok all day.
es_419: Quizá sea porque estuve todo el día con Wooseok.

source: Please follow me.
es_419: Por favor, sígame.

source: Haha, sorry.
es_419: Jaja, perdón.

source: W-Well…
es_419: Bu-Bueno…

source: We have the V.I.P. room ready for you.
es_419: Le preparamos la sala vip.

source: Sorry.
es_419: Perdón.

source: Shall we get going as well?
es_419: ¿Nos vamos también?

source: Phew…
es_419: Fiuu…

source: I heard you two were meeting up.
es_419: Me enteré de que se iban a ver.

source: Until next time, Mr. Lee.
es_419: Hasta la próxima, señor Lee.

source: That's when we picked all these strawberries.
es_419: Recogimos todas estas fresas.

source: Let's go.
es_419: Vamos.

source: …that he's a C.E.O.
es_419: que es un CEO.

source: See you tomorrow, Yujin.
es_419: Hasta mañana, Yujin.

source: I came here on a personal matter, so I didn't call you.
es_419: Vine por un asunto personal, por eso no avisé.

source: Call me the competent assistant!
es_419: ¡Llámeme el asistente eficiente!

source: Then, how about we look around a little more?
es_419: ¿Qué te parece si seguimos mirando un poco más?

source: Ah, so it was him that I saw that night.
es_419: Ah, era él al que vi la otra noche.

source: Well…
es_419: Bueno…

source: Dazzle
es_419: Deslumbrada

source: New Strawberry Latte R 4,500
es_419: Nuevo Latte de fresa 4500

source: I know.
es_419: Lo sé.

source: I'm acting like a pervert!
es_419: ¡Parezco una pervertida!

source: You're seriously meeting him again?
es_419: ¿De verdad vas a verlo de nuevo?

source: Laundry complete.
es_419: Lavado completo.

source: You want to come, too?
es_419: ¿Quieres venir también?

source: I guess you might know him, too.
es_419: Seguro ya lo conoces.

source: Sorry, I have to take this.
es_419: Disculpen, tengo que atender.

source: I think it's best to be careful.
es_419: Lo mejor es ir con cuidado.

source: Others might find it strange if they see you meeting with him in private.
es_419: Para la gente podría ser raro verte reunida con él en privado.

source: So heavy!!!
es_419: ¡¡Qué pesado!!

source: Beep…
es_419: Bip

source: You seemed super busy.
es_419: Parecías muy ocupado.

source: I told you we should've gone to the market…
es_419: Te dije que deberíamos haber ido al mercado.

source: Rush
es_419: Fuush

source: I wasn't aware of your visit tonight.
es_419: No sabía que vendría.

source: I should've told you Hyuntae was coming.
es_419: Debí avisarte que vendría Hyuntae.

source: Wobble
es_419: Tambalea

source: No, no, I'm alright.
es_419: No, no, estoy bien.

source: Yes, yes.
es_419: Sí, sí.

source: Still…
es_419: Pero…

source: Thank you for the wonderful gift.
es_419: Gracias por este regalo maravilloso.

source: Over here!
es_419: ¡Por aquí!

source: Clench
es_419: Aprieta

source: I'll see you soon.
es_419: Nos vemos pronto.

source: Gosh, what am I thinking?!
es_419: Cielos, ¡¿en qué estoy pensando?!

source: Bzzt
es_419: Bzzz

source: Yeah… One thing led to another…
es_419: Sí. Una cosa llevó a la otra…

source: Oh, one of her friends came by to help.
es_419: Ah, un amigo de ella vino a ayudar.

source: How does it feel to wear a leather rider jacket for the first time?
es_419: ¿Cómo se siente usar una chaqueta de cuero por primera vez?

source: Oh, and this one…
es_419: ¡Ah, y esto!

source: Just pick out something nice for your grandma.
es_419: Elige algo lindo para tu abuela.

source: She gave me so much to eat.
es_419: Me dio mucha comida.

source: Do you mind?
es_419: ¿Te molesta?

source: How about we grab a beer?
es_419: ¿Quieres ir a tomar una cerveza?

source: N-no, of course not…
es_419: No-no, claro que no…

source: Understood, sir.
es_419: Entendido, señor.

source: They look so tasty!
es_419: ¡Se ven deliciosas!

source: His name was…
es_419: Se llamaba…

source: Why today of all days…?
es_419: Pero ¿por qué justo hoy…?

source: Ahem…
es_419: Ejem…

source: One Americano and one chocolate latte, please.
es_419: Un americano y un latte de chocolate, por favor.

source: Hurry with that photo.
es_419: Saca ya la foto,

source: Why don't you keep it simple and strict?
es_419: ¿Y si lo hace de forma simple y directa?

source: Haa…
es_419: Ehh…

source: Plop
es_419: Plof

source: I'm glad.
es_419: Me alegro.

source: New Strawberry Yogurt Parfait L 5,800
es_419: Nuevo Parfait de yogur y fresas 5800

source: I should've notified the staff members.
es_419: Tendría que haber avisado que vendría.

source: I'll try something wittier.
es_419: Escribiré algo más ingenioso.

source: Haha.
es_419: Jaja.

source: Whoa, the strawberries look so colorful.
es_419: Vaya, qué buen color tienen las fresas.

source: Shudder
es_419: Tiembla

source: How about this week?
es_419: ¿Te parece bien esta semana?

source: Thaniks.
es_419: Gracias.

source: But I'm meeting him right now.
es_419: Pero nos vemos ahora mismo.

source: Oh, you guys have a new menu with strawberries.
es_419: Ey, tienen un menú nuevo con fresas.

source: It's been a while, Mr. Lee.
es_419: Tanto tiempo, señor Lee.

source: See you around, sir.
es_419: Nos vemos pronto, señor.

source: But I'm the perfect assistant who can handle it all!!
es_419: Pero ¡¡soy el asistente perfecto que puede con todo!!

source: Yujin, wait here.
es_419: Yujin, espérame aquí.

source: Say thanks to your grandma for me.
es_419: Agradécele a tu abuela de mi parte.

source: It's a gift for her grandmother.
es_419: Es un regalo para su abuela.

source: Haha!
es_419: ¡Jaja!

source: You know what?
es_419: ¿Sabes qué?

source: What are we waiting for?
es_419: ¿Qué esperas?

source: What is it this time?
es_419: ¿Y ahora por qué?

source: I'd rather buy something nice from a department store.
es_419: Prefiero comprarle algo lindo en un centro comercial.

source: Pajamas have too many buttons.
es_419: Los pijamas tienen demasiados botones.

source: Try this one too!!!
es_419: ¡¡¡Pruébate esto también!!!

source: Why not?
es_419: ¿Por qué no?

source: Yeah, sure.
es_419: Sí, claro.

source: They've got more practical stuff.
es_419: Tienen cosas más útiles.

source: Oh, and I'd like to ask you a favor.
es_419: Ah, y quisiera pedirte un favor.

source: Oh, it's not much!
es_419: Ay, ¡no es mucho!

source: What do I do?
es_419: ¿Qué hago?

source: I wanted to say sorry hours ago, but I couldn't find the right moment.
es_419: Hace horas que quiero disculparme, pero no encontraba el momento.

source: Are you sure you don't need me there?
es_419: ¿En serio no quieres que te acompañe?

source: Duty calls.
es_419: El deber me llama.

source: No, the pleasure is all mine.
es_419: De nada, es un placer.

source: Who are you meeting?
es_419: ¿Con quién?

source: Well?
es_419: ¿Y bien?

source: What's going on?
es_419: ¿Qué pasa?

source: Well!{j}Shall we?
es_419: Bueno,{j}¿vamos?

source: I got so carried away.
es_419: Me dejé llevar.

source: Thank you for coming out here today, Yujin.
es_419: Gracias por acompañarme, Yujin.

source: I knew it.
es_419: Lo sabía.

source: I wanted to tell you but I couldn't find the right time to do so.
es_419: Quería contarte, pero no encontré el momento oportuno.

source: He's mad at me…
es_419: Está enojado conmigo.

source: It's just unexpected, that's all.
es_419: No me lo esperaba, nada más.

source: When are we going?
es_419: ¿Cuándo vamos?

source: Oh, right!!
es_419: ¡¡Ah, claro!!

source: Oh, you didn't have to bag them… thank you.
es_419: Ay, no hacía falta la bolsa… Gracias.

source: They're not getting along at all!!
es_419: ¡¡No se llevan nada bien!!

source: Mr. Jung!
es_419: ¡Señor Jung!

source: Who was that?
es_419: ¿Quién era?

source: Taekyung…?
es_419: ¿En Taekyung?

source: Tasty, huh?
es_419: Está rico, ¿no?

source: Mutter
es_419: Murmura

source: Then take me with you.
es_419: Entonces, llévame contigo.

source: He wanted me to help him choose a gift for her…
es_419: y quería que yo lo ayudara a elegir el regalo…

source: Hm…
es_419: Mmm…

source: Hello.
es_419: Hola.

source: No, I arrived just now.
es_419: No, recién.

source: Agh!!!
es_419: ¡¡Ahh!!

source: Looks like the new menu is another hit, boss.
es_419: Parece que el menú nuevo es un éxito, jefa.

source: He may be down-to-earth, but he's still our boss, so to speak.
es_419: Tendrá los pies en la tierra, pero sigue siendo nuestro jefe.

source: What are you talking about…?
es_419: ¿De qué habla?

source: Simple and strict…?
es_419: ¿Simple y directo…?

source: Growl
es_419: Grrr

source: I wish I hadn't skipped lunch today…
es_419: Ojalá hubiera almorzado algo…

source: I wonder if there's a repair shop nearby…
es_419: ¿Habrá una zapatería cerca…?

source: Shiver
es_419: Se estremece

source: That's… too silly.
es_419: Y esto… es muy tonto.

source: Wooseok's Showtime
es_419: El show de Wooseok

source: Clasp
es_419: Agarra

source: When should I pick those up?
es_419: ¿Cuándo puedo pasar a buscar la ropa?

source: Bicker
es_419: Riñen

source: What?
es_419: ¿Qué?

source: I won't be needing your services today.
es_419: No necesitaré sus servicios hoy.

source: Ground turmeric
es_419: Cúrcuma molida

source: As a thank you, let me take you out to dinner.
es_419: Como agradecimiento, déjame invitarte a cenar.

source: Good evening, sir.
es_419: Buenas tardes, señor.

source: Mr. Jung Wooseok
es_419: Señor Jung Wooseok

source: Mind if I come with you?
es_419: ¿Le molesta si los acompaño?

source: No, not at all.
es_419: No, para nada.

source: You look good in everything.
es_419: Todo te queda bien.

source: Grin
es_419: Sonríe

source: Chili seasoning
es_419: Chili en polvo

source: Today?
es_419: ¿Hoy?

source: Slide
es_419: Desliza

source: Thanks, Hyuntae!
es_419: ¡Gracias, Hyuntae!

source: That construction site down at XX district.
es_419: Llamaron de la obra del distrito XX.

source: Ah, Yumin's clothes!
es_419: ¡Ah, la ropa de Yumin!

source: That's why…
es_419: Era por eso.

source: Turn
es_419: Gira

source: Here, try this too.
es_419: Toma, prueba esto.

source: I didn't know you were coming, too.
es_419: No sabía que vendría con nosotros.

source: Hey, Yujin.
es_419: Oye, Yujin.

source: Hello, Mr. Jung.
es_419: Hola, señor Jung.

source: Yeah, I'll call you when I get there.
es_419: Sí, te llamaré cuando llegue.

source: and drove me home.
es_419: y me llevó a casa.

source: Haha
es_419: Jaja

source: Sorry…
es_419: Perdón…

source: It's hardly an appropriate gift for an old lady.
es_419: No es un regalo apropiado para una abuela.

source: Ground nutmet
es_419: Nuez moscada

source: It's only been a few days… why do I feel so nervous?
es_419: Solo pasaron unos días… ¿Por qué tantos nervios?

source: Sweat
es_419: Suda

source: Come on!
es_419: ¡Vamos!

source: You look perfect in sportswear, too!!
es_419: ¡¡También te ves bien con ropa deportiva!!

source: Whoa, both of you settle down now…
es_419: Ey, cálmense los dos.

source: Oh, I was on my way out when I heard you were coming.
es_419: Me estaba por ir cuando supe que usted vendría.

source: No, I'm sorry, too.
es_419: No, yo también lo siento.

source: This way.
es_419: Por aquí.

source: I couldn't say no.
es_419: No podía negarme.

source: I've got an idea for the gift.
es_419: Tengo una idea para el regalo.

source: Missing clothes looking for their owner.
es_419: Ropa perdida busca a su dueño.

source: It just so happened that Grandma came by that day...
es_419: Y justo mi abuela vino a casa ese día…

source: You don't mind that I'm here, do you?
es_419: No le molesta que los acompañe, ¿no?

source: I'm meeting Mr. Jung.
es_419: Me reuniré con el señor Jung.

source: Uh…
es_419: Eh…

source: An hour ago…
es_419: Una hora antes…

source: I apologize for the late reception.
es_419: Perdón por no atenderlo antes.

source: My body feels strangely tense today.
es_419: Me siento más cansada que de costumbre.

source: Are you alright?
es_419: ¿Estás bien?

source: well, we do have the best ingredients.
es_419: Bueno, los ingredientes son de primera.

source: I wonder if Wooseok made it home okay.
es_419: ¿Wooseok habrá llegado bien a su casa?

source: I'll go there by myself.
es_419: iré yo solo.

source: Sorry, I'm late.
es_419: Perdón por la tardanza.

source: Thank God she didn't say anything.
es_419: Gracias a Dios, no dijo nada.

source: Maybe I should eat some now.
es_419: Quizá coma algo ahora.

source: Is this a test?
es_419: ¿Será una prueba?

source: Wh-what?
es_419: ¿Qué?

source: It's still good, but it tasted better back there.
es_419: Aún sabe bien, pero estaba más rico allá.

source: Both iced.
es_419: Con hielo.

source: He sounds funny, haha.
es_419: Es divertido, jaja.

source: Never mind.
es_419: No te preocupes,

source: How do you arrange plans with someone in a way that's simple but not too dull, witty but not too in your face?
es_419: ¿Cómo se hacen planes con alguien de una manera simple, pero no muy tonta, con ingenio pero sin ser tan obvio?

source: It's my chance to patch things up with Hyuntae.
es_419: Es mi oportunidad de arreglar las cosas con Hyuntae.

source: I haven't worked so hard in a while.
es_419: Hacía mucho que no trabajaba tanto.

source: Bow
es_419: Reverencia

source: New Red velvet shortcake 6,600
es_419: Nuevo Tarta Red Velvet 6600

source: Beep
es_419: Bip

source: They sell a lot of things too…
es_419: Ahí también hay mucha variedad.

source: And wouldn't you know it…
es_419: Obviamente no lo sabes…

source: Yes…
es_419: Sí…

source: They need us right now.
es_419: Nos necesitan urgente.

source: Sir?
es_419: ¿Señor?

source: Whoa… these, my grandma is sure to like!
es_419: Vaya… ¡A mi abuela le encantará esto!

source: Shrug
es_419: Presume

source: Mph!
es_419: ¡Uf!

source: Nice timing!!
es_419: ¡¡Justo a tiempo!!

source: No… that's too bossy.
es_419: No, sueno muy mandón.

source: But next time, take me with you.
es_419: Pero la próxima vez, llévame contigo.

source: Hyuntae, we already went there last weekend.
es_419: Hyuntae, ya fuimos el fin de semana.

source: Mr. Competent
es_419: Señor Eficiencia

source: I see.
es_419: Ya veo.

source: I should just sleep…
es_419: Debería dormirme…

source: She's really into all sorts of spices.
es_419: y le encantan las especias.

source: I'll be right back!
es_419: ¡¡Enseguida vuelvo!!

source: it was nice to see another side of him.
es_419: fue lindo ver ese otro lado de él.

source: Can you still join us?
es_419: ¿Vas a poder venir?

source: Why did I stare like that…?!
es_419: ¡¿Por qué me quedé mirándolo así?!

source: Actually, he came by the office the other day
es_419: De hecho, vino a la oficina el otro día

source: S-sorry… I have to meet someone today.
es_419: Pe-Perdona. Me voy a encontrar con alguien.

source: Well, no need to apologize.
es_419: No tienes que disculparte.

source: He said he works at Taekyung.
es_419: Dijo que trabajaba en Taekyung.

source: That's alright.
es_419: Descuide.

source: Swing
es_419: Abre

source: You know I can't stand being cold…
es_419: Sabes que no soporto el frío…

source: You're a C.E.O., after all.
es_419: Después de todo, usted es un CEO.

source: Excuse me.
es_419: Disculpe.

source: I-it's more comfy than I thought.
es_419: No-no creí que fuera tan cómoda.

source: I liked it.
es_419: Me gustó.

source: Hello, sir.
es_419: Hola, señor.

source: Call me!
es_419: ¡Llámame!

source: Right now?
es_419: ¿Ahora?

source: Are they going to be alright?
es_419: ¿Se llevarán bien?

source: No, this is also a first for me.
es_419: Está bien. También todo esto es nuevo para mí.

source: That wasn't it, either.
es_419: No era así tampoco.

source: Bye now.
es_419: Adiós.

source: Why didn't you call me?
es_419: ¿Por qué no me avisaste?

source: Sir, if we head out to the market, we might still--
es_419: Señor, si salimos ya para el mercado, quizá…

source: Did you sprain your ankle?
es_419: ¿Te torciste el tobillo?

source: So fun
es_419: Qué divertido

source: I feel a bit tired.
es_419: Qué cansancio.

source: I'll have to return your clothes.
es_419: Tengo que devolverte la ropa.

source: Uh… the thing is…
es_419: Eh, lo que pasa…

source: I keep forgetting…
es_419: Se me olvida…

source: Shall we?
es_419: ¿Vamos?

source: When are you available?
es_419: ¿Cuándo estás libre?

source: If you're looking for a variety of things, the market's way better.
es_419: Si lo que buscan es variedad, lo mejor es el mercado.

source: After what happened the other day, I should come clean, right?
es_419: Después de lo del otro día, debería sincerarme, ¿no?

source: Did you wait long?
es_419: ¿Llegaste hace mucho?

source: Y-Yujin…?
es_419: ¿Yu-Yujin?

source: Oh, and you can't go wrong with a shirt and pullover!
es_419: ¡Y una camisa con un suéter nunca falla!

source: Yeah, that'll be--
es_419: Sí, sería…

source: I want to taste it.
es_419: que quiero probar todo.

source: He just wanted to make up for Grandma's hospitality the other day.
es_419: Quiere comprarle algo a mi abuela para agradecerle su hospitalidad,

source: Isn't it about time we pick strawberries at your grandma's farm?
es_419: ¿No hay que recoger las fresas en la granja de tu abuela?

source: She likes western good.
es_419: Le gusta la comida occidental

source: I wonder why…
es_419: ¿Por qué será…?

source: Thanks for lending me Yumin's clothes.
es_419: Gracias por prestarme la ropa de Yumin.

source: Yeah?
es_419: ¿Sí?

source: Should I come, too?
es_419: ¿Yo también tengo que ir?

source: We'll get going now!
es_419: ¡Ya nos vamos!

source: Ah, I believe it was Wooseok.
es_419: Ay, creo que se llamaba Wooseok.
